reports/mysql-coupon-loadtest/runs/pool20-n100-500rps-005/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/coupon-arrival-rate.js
        output: -

     scenarios: (100.00%) 1 scenario, 6000 max VUs, 40s max duration (incl. graceful stop):
              * unique_member_first_request: 500.00 iterations/s for 10s (maxVUs: 3000-6000, gracefulStop: 30s)


running (00.6s), 0004/3000 VUs, 283 complete and 0 interrupted iterations
unique_member_first_request   [   6% ] 0004/3000 VUs  00.6s/10s  500.00 iters/s

running (01.6s), 0346/3000 VUs, 441 complete and 0 interrupted iterations
unique_member_first_request   [  16% ] 0346/3000 VUs  01.6s/10s  500.00 iters/s

running (02.6s), 0034/3000 VUs, 1253 complete and 0 interrupted iterations
unique_member_first_request   [  26% ] 0034/3000 VUs  02.6s/10s  500.00 iters/s

running (03.6s), 0003/3000 VUs, 1784 complete and 0 interrupted iterations
unique_member_first_request   [  36% ] 0003/3000 VUs  03.6s/10s  500.00 iters/s

running (04.6s), 0004/3000 VUs, 2282 complete and 0 interrupted iterations
unique_member_first_request   [  46% ] 0004/3000 VUs  04.6s/10s  500.00 iters/s

running (05.6s), 0003/3000 VUs, 2784 complete and 0 interrupted iterations
unique_member_first_request   [  56% ] 0003/3000 VUs  05.6s/10s  500.00 iters/s

running (06.6s), 0004/3000 VUs, 3283 complete and 0 interrupted iterations
unique_member_first_request   [  66% ] 0004/3000 VUs  06.6s/10s  500.00 iters/s

running (07.6s), 0005/3000 VUs, 3781 complete and 0 interrupted iterations
unique_member_first_request   [  76% ] 0005/3000 VUs  07.6s/10s  500.00 iters/s

running (08.6s), 0006/3000 VUs, 4281 complete and 0 interrupted iterations
unique_member_first_request   [  86% ] 0006/3000 VUs  08.6s/10s  500.00 iters/s

running (09.6s), 0003/3000 VUs, 4784 complete and 0 interrupted iterations
unique_member_first_request   [  96% ] 0003/3000 VUs  09.6s/10s  500.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 5016   495.844132/s
    checks_succeeded...: 99.96% 5014 out of 5016
    checks_failed......: 0.03%  2 out of 5016

    ✗ business response or no server error
      ↳  99% — ✓ 5014 / ✗ 2

    CUSTOM
    coupon_issue_business_response_under_2s...: 99.96% 5014 out of 5016
    coupon_issue_issued.......................: 5014   495.646427/s

    HTTP
    http_req_duration.........................: avg=90.45ms min=0s     med=12.85ms max=1.05s p(90)=419.87ms p(95)=508.29ms p(99)=644.56ms
      { expected_response:true }..............: avg=90.49ms min=2.57ms med=12.88ms max=1.05s p(90)=419.96ms p(95)=508.29ms p(99)=644.57ms
    http_req_failed...........................: 0.03%  2 out of 5016
    http_reqs.................................: 5016   495.844132/s

    EXECUTION
    iteration_duration........................: avg=95.8ms  min=2.7ms  med=14.49ms max=1.09s p(90)=426.93ms p(95)=535.05ms p(99)=678.66ms
    iterations................................: 5016   495.844132/s
    vus.......................................: 3      min=3            max=346 
    vus_max...................................: 3000   min=3000         max=3000

    NETWORK
    data_received.............................: 1.2 MB 117 kB/s
    data_sent.................................: 1.6 MB 157 kB/s



running (10.1s), 0000/3000 VUs, 5016 complete and 0 interrupted iterations
unique_member_first_request ✓ [ 100% ] 0000/3000 VUs  10s  500.00 iters/s